In [1]:
# https://leetcode.cn/problems/replace-employee-id-with-the-unique-identifier/?envType=study-plan-v2&envId=sql-free-50
# [join兩表：merge、fillna("替換值")] 用id串接兩表並輸出，其中空值請用null填充
# A表：id、name
# B表：id、unique_id

In [2]:
import pandas as pd
d1={
    "id":[1,7,11,90,3],
    "name":["Alice","Bob","Meir","Winston","Jonathan"]
}

d2={
    "id":[3,11,90],
    "unique_id":[1,2,3]
}

employees=pd.DataFrame(d1)
employee_uni=pd.DataFrame(d2)

print(employees)

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [3]:
print(employee_uni)

   id  unique_id
0   3          1
1  11          2
2  90          3

In [4]:
def replace_employee_id1(employees: pd.DataFrame, employee_uni: pd.DataFrame) -> pd.DataFrame:
    return(
        pd.merge(employees,employee_uni,how="left",on="id")
    )
    
replace_employee_id1(employees, employee_uni)

# 會發現一件事：表格的樣式不太一樣
# 直接用字典創建並打印 DataFrame會顯示預設設置

   id      name  unique_id
0   1     Alice        NaN
1   7       Bob        NaN
2  11      Meir        2.0
3  90   Winston        3.0
4   3  Jonathan        1.0

In [ ]:
# 這裡會發現一件事，它的空值是：Nan，而如果我們一定要他呈現"Null"時：
# 1.若需要的是資料庫內部的 NULL，那就留著 NaN， Pandas 在 .to_sql() 時會自動轉為 NULL
# 2.使用.fillna("要轉換成的字串")：DataFrame.fillna(value, inplace=False)
# value: 你想用來取代 NaN 的值，例如 "null"、0、平均值等等
# inplace: 預設是 False，如果設為 True，就會直接修改原來的 DataFrame，而不會回傳新的

def replace_employee_id2(employees: pd.DataFrame, employee_uni: pd.DataFrame) -> pd.DataFrame:
    merged = pd.merge(employees, employee_uni, how="left", on="id")
    merged = merged.fillna("null") 
    return merged
replace_employee_id2(employees, employee_uni)

# 如果只想針對特定的column做fillna替換填充：
# merged["unique_id"] = merged["unique_id"].fillna("null")

   id      name unique_id
0   1     Alice      null
1   7       Bob      null
2  11      Meir       2.0
3  90   Winston       3.0
4   3  Jonathan       1.0